flow-around-controlled-moving-cylinder/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         7;

deltaT          0.00025;

writeControl    adjustableRunTime;

writeInterval   .5;

purgeWrite      0;

writeFormat    ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           0.75;

functions
{
   #includeFunc forces
   #includeFunc preCICE_Adapter 
}
