flow-around-controlled-moving-cylinder/fluid-openfoam/constant/RASProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}

RASModel        laminar;

turbulence      off;

printCoeffs     on;
