flow-around-controlled-moving-cylinder/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

motionSolverLibs ("libfvMotionSolvers.so");

dynamicFvMesh dynamicMotionSolverFvMesh;

solver      displacementLaplacian;
// OpenFOAM9 or newer: rename "solver" to "motionSolver"

displacementLaplacianCoeffs 
{
    diffusivity inverseDistance 1(cylinder);
}
