flow-around-controlled-moving-cylinder/fluid-openfoam/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	
    topAndBottom
    {
        type            zeroGradient;
    } 

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    cylinder
    {
        type            zeroGradient;
    }

}
