flow-around-controlled-moving-cylinder/fluid-openfoam/system/preCICE_Adapter
type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");
